PeleAB/STM32N6-FaceRecognition/Src/main.c
/* ========================================================================= */
/* EDUCATIONAL FACE RECOGNITION PIPELINE                                    */
/* ========================================================================= */
/*
 * This pipeline demonstrates a complete face detection and recognition system
 * broken down into clear, educational stages:
 *
 * 🔄 PIPELINE OVERVIEW:
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │  STAGE 1: Frame Capture & Preprocessing                                │
 * │  📸 Capture frame from camera → Convert to neural network format       │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 2: Face Detection Network                                       │
 * │  🧠 Run CNN to detect faces → Extract bounding boxes                   │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 3: Post-Processing                                              │
 * │  ⚙️ Convert network output → Extract face bounding boxes               │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 4: Face Recognition                                             │
 * │  🔍 Crop faces → Run recognition network → Compare with stored faces   │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 5: System Status Update                                         │
 * │  💡 Update LEDs → Handle buttons → Send communication                  │
 * └─────────────────────────┬───────────────────────────────────────────────┘
 *                           │
 * ┌─────────────────────────▼───────────────────────────────────────────────┐
 * │  STAGE 6: Output & Metrics                                             │
 * │  📊 Display results → Calculate performance → Clean up                 │
 * └─────────────────────────────────────────────────────────────────────────┘
 */

/* ========================================================================= */
/* PIPELINE STAGE FUNCTIONS                                                 */
/* ========================================================================= */

/**
 * @brief Pipeline Stage 1: Frame Capture and Preprocessing
 * @param ctx Application context
 * @param pitch_nn Neural network pitch value
 * @return 0 on success, negative on error
 */
static int pipeline_stage_capture_and_preprocess(app_context_t *ctx, uint32_t pitch_nn)
{
    printf("📸 PIPELINE STAGE 1: Frame Capture\n");
    
    /* Step 1.1: Capture frame from camera or PC stream */
    if (app_get_frame(nn_rgb, pitch_nn) != 0) {
        printf("❌ Frame capture failed\n");
        return -1;
    }
    
#ifdef DUMMY_INPUT_BUFFER
    /* Step 1.1.5: Override both img_buffer and nn_rgb with dummy data for testing */
    load_dual_dummy_buffers();
#endif
    
    /* Step 1.2: Convert RGB to neural network input format */
    printf("   🔄 Converting RGB to CHW format for neural network...\n");
    img_rgb_to_chw_float(nn_rgb, (float32_t *)ctx->nn_ctx.detection_input_buffer, 
                        NN_WIDTH * NN_BPP, NN_WIDTH, NN_HEIGHT);
    


    /* Step 1.3: Prepare data for neural network (cache management) */
    printf("   🧠 Preparing %lu bytes for neural network input...\n", ctx->nn_ctx.detection_input_length);
    SCB_CleanInvalidateDCache_by_Addr(ctx->nn_ctx.detection_input_buffer, 
                                     ctx->nn_ctx.detection_input_length);
    
    printf("✅ Frame captured and preprocessed (%dx%d → %lu bytes)\n", 
           NN_WIDTH, NN_HEIGHT, ctx->nn_ctx.detection_input_length);
    return 0;
}

/**
 * @brief Pipeline Stage 2: Face Detection Neural Network
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_face_detection(app_context_t *ctx)
{
    printf("🧠 PIPELINE STAGE 2: Face Detection Network\n");
    
    /* Step 2.1: Run face detection neural network */
    printf("   🚀 Running face detection neural network inference...\n");
    uint32_t start_time = HAL_GetTick();
    RunNetworkSync(&NN_Instance_face_detection);
    uint32_t inference_time = HAL_GetTick() - start_time;
    
    /* Step 2.2: Network cleanup */
    printf("   🧹 Cleaning up neural network resources...\n");
    LL_ATON_RT_DeInit_Network(&NN_Instance_face_detection);
    
    printf("✅ Face detection completed in %lu ms (%d outputs ready)\n", 
           inference_time, ctx->nn_ctx.detection_output_count);
    return 0;
}

/**
 * @brief Pipeline Stage 3: Post-Processing and Face Extraction
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int pipeline_stage_postprocessing(app_context_t *ctx)
{
    printf("⚙️ PIPELINE STAGE 3: Post-Processing\n");
    
    /* Step 3.1: Run post-processing to extract bounding boxes */
    printf("   🔍 Processing %d neural network outputs...\n", ctx->nn_ctx.detection_output_count);
    int32_t ret = app_postprocess_run((void **) ctx->nn_ctx.detection_output_buffers, 
                                     ctx->nn_ctx.detection_output_count, 
                                     &ctx->pp_output, &ctx->pp_params);
    if (ret != 0) {
        printf("❌ Post-processing failed\n");
        return -1;
    }
    
    /* Step 3.2: Extract detected faces */
    pd_pp_box_t *boxes = (pd_pp_box_t *)ctx->pp_output.pOutData;
    printf("   📦 Extracted %d face bounding boxes\n", ctx->pp_output.box_nb);
    
    /* Step 3.3: Log detection details for educational purposes */
    for (uint32_t i = 0; i < ctx->pp_output.box_nb && i < 3; i++) {
        printf("   📍 Face %d: confidence=%.3f, center=(%.2f,%.2f), size=%.2fx%.2f\n", 
               i + 1, boxes[i].prob, boxes[i].x_center, boxes[i].y_center, 
               boxes[i].width, boxes[i].height);
    }
    
